import { Link } from "react-router-dom";

const Header = () => {

  return (
    <header className="header">
      <div className="container">
        <div className="header__block">
          <div className="header__left">
            <img
              className="header__logo"
              src="./Logo.png"
              alt="Logo"
              width="176"
              height="72"
              loading="lazy"
            />
          </div>
          <div className="header__rigth">
            <div className="header__telephone">
              <div className="header__telephone-top">
                <svg
                  width="9"
                  height="14"
                  viewBox="0 0 9 14"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M6.1875 14H2.8125C1.26169 14 0 12.6916 0 11.0833V2.91667C0 1.30842 1.26169 0 2.8125 0H6.1875C7.73831 0 9 1.30842 9 2.91667V11.0833C9 12.6916 7.73831 14 6.1875 14ZM2.8125 1.16667C1.88213 1.16667 1.125 1.95183 1.125 2.91667V11.0833C1.125 12.0482 1.88213 12.8333 2.8125 12.8333H6.1875C7.11788 12.8333 7.875 12.0482 7.875 11.0833V2.91667C7.875 1.95183 7.11788 1.16667 6.1875 1.16667H2.8125ZM5.625 11.0833C5.625 10.7613 5.373 10.5 5.0625 10.5H3.9375C3.627 10.5 3.375 10.7613 3.375 11.0833C3.375 11.4053 3.627 11.6667 3.9375 11.6667H5.0625C5.373 11.6667 5.625 11.4053 5.625 11.0833Z"
                    fill="#757C82"
                  />
                </svg>
                <Link to="tel:88001111111" className="header__telephone-link">8 800 111-11-11</Link>
              </div>
              <p className="header__telephone-text">Заказать звонок</p>
            </div>
            <div className="header__email">
              <div className="header__email-top">
                <svg
                  width="15"
                  height="13"
                  viewBox="0 0 15 13"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.875 0H3.125C2.2965 0.000938279 1.50222 0.312521 0.916387 0.866403C0.330551 1.42028 0.000992411 2.17124 0 2.95455L0 10.0455C0.000992411 10.8288 0.330551 11.5797 0.916387 12.1336C1.50222 12.6875 2.2965 12.9991 3.125 13H11.875C12.7035 12.9991 13.4978 12.6875 14.0836 12.1336C14.6694 11.5797 14.999 10.8288 15 10.0455V2.95455C14.999 2.17124 14.6694 1.42028 14.0836 0.866403C13.4978 0.312521 12.7035 0.000938279 11.875 0ZM3.125 1.18182H11.875C12.2492 1.18251 12.6147 1.28908 12.9243 1.48779C13.234 1.68651 13.4737 1.96829 13.6125 2.29686L8.82625 6.82264C8.47402 7.15432 7.99713 7.34055 7.5 7.34055C7.00287 7.34055 6.52598 7.15432 6.17375 6.82264L1.3875 2.29686C1.52634 1.96829 1.76601 1.68651 2.07565 1.48779C2.3853 1.28908 2.75076 1.18251 3.125 1.18182ZM11.875 11.8182H3.125C2.62772 11.8182 2.15081 11.6314 1.79917 11.299C1.44754 10.9665 1.25 10.5156 1.25 10.0455V3.84091L5.29 7.65818C5.87664 8.21142 6.67141 8.52211 7.5 8.52211C8.32859 8.52211 9.12336 8.21142 9.71 7.65818L13.75 3.84091V10.0455C13.75 10.5156 13.5525 10.9665 13.2008 11.299C12.8492 11.6314 12.3723 11.8182 11.875 11.8182Z"
                    fill="#757C82"
                  />
                </svg>
                <Link to="" className="header__email-link">info@bassco.ru</Link>
              </div>
              <p className="header__email-text">По любым вопросам</p>
            </div>
            <button className="header__cooperation-btn">Сотрудничество</button>
          </div>
        </div>
      </div>
    </header>
  );
};

export default Header